# Titanic excel file import

In [5]:
import pandas as pd
my_data=pd.read_csv('tested.csv')

In [7]:
my_data.head(2)
my_data.shape
my_data.columns
my_data.info()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [9]:
my_data['Embarked'].value_counts()

Embarked
S    270
C    102
Q     46
Name: count, dtype: int64

# HomeWork- Titanic Full

In [13]:
new_data= pd.read_csv('full.csv')

new_data.head() #shows the heading of the file

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0

In [12]:
new_data.info() #gives all the info about the file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 21 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
 12  WikiId       1304 non-null   float64
 13  Name_wiki    1304 non-null   object
 14  Age_wiki     1302 non-null   float64
 15  Hometown     1304 non-null   object
 16  Boarded      1304 non-null   object
 17  Destination  1304 non-null   object
 18  Lifeboat     502 non-null    object
 19  Body         130 non-null    object
 20  Class        1304 non-null   float64
dtypes: float64(6), int64(4), object(11)
memory usage: 214.9+ KB

In [15]:
new_data.shape #gives the size of the data, ie no of rows and columns

(1309, 21)

In [17]:
new_data.columns #gives the title of each column

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'WikiId', 'Name_wiki',
       'Age_wiki', 'Hometown', 'Boarded', 'Destination', 'Lifeboat', 'Body',
       'Class'],
      dtype='object')

In [19]:
#getting the column info for business insights- analyzing the data

new_data['Survived'].value_counts()
#result shows us the number of people that survived and number of people that didnt by segregating dead and alive with 0's and 1's

Survived
0.0    549
1.0    342
Name: count, dtype: int64

In [21]:
new_data['Pclass'].value_counts()
#shows the number of people under various classes to know which class has the most and which one has the least, which could be used for business purposes

Pclass
3    709
1    323
2    277
Name: count, dtype: int64

In [23]:
new_data['Sex'].value_counts()
#Shows us the number of males and females

Sex
male      843
female    466
Name: count, dtype: int64

In [25]:
new_data['Age'].value_counts()
#gives insight on the age groups- which can be further summed up with the help of amother function

Age
24.0    47
22.0    43
21.0    41
30.0    40
18.0    39
        ..
23.5     1
70.5     1
55.5     1
20.5     1
38.5     1
Name: count, Length: 98, dtype: int64

In [27]:
new_data['SibSp'].value_counts()
#Gives the number or siblings/Spouses the individual has along, with 0 indicating the people that were not accompanied by a sibling or spouse

SibSp
0    891
1    319
2     42
4     22
3     20
8      9
5      6
Name: count, dtype: int64

In [29]:
new_data['Parch'].value_counts()
#Gives the number or Parents/Children the individual has along, with 0 indicating the people that were not accompanied by a parent or child

Parch
0    1002
1     170
2     113
3       8
5       6
4       6
6       2
9       2
Name: count, dtype: int64

In [31]:
new_data['Fare'].value_counts()
#Gives the amount of fair paid, also providing info on how many paid how much along with people who didnt pay (not in this instance)

Fare
8.0500     60
13.0000    59
7.7500     55
26.0000    50
7.8958     49
           ..
7.7417      1
8.1583      1
8.4583      1
7.8000      1
7.7208      1
Name: count, Length: 281, dtype: int64

In [33]:
new_data['Cabin'].value_counts()
#Shows how many were given a cabin, can help when we need to add more people to a cabin that contains least people

Cabin
C23 C25 C27        6
G6                 5
B57 B59 B63 B66    5
C22 C26            4
F33                4
                  ..
A14                1
E63                1
E12                1
E38                1
C105               1
Name: count, Length: 186, dtype: int64

In [35]:
new_data['Embarked'].value_counts()
#The S indicates Southampton, Q indicates Queenstown and C indicates Cherbourg here. This gives us insight about the embarking point which was the busiest and hence most revenue generating

Embarked
S    914
C    270
Q    123
Name: count, dtype: int64

In [37]:
new_data['Destination'].value_counts()
#Insights into the destination of the passengers

Destination
New York City                          234
New York, New York, US                 127
Chicago, Illinois, US                   75
Montreal, Quebec, Canada                37
Detroit, Michigan, US                   28
                                      ...
East Bridgewater, Massachusetts, US      1
Oregon, Wisconsin, US                    1
Rahway, New Jersey, US                   1
Stoughton, Massachusetts                 1
US                                       1
Name: count, Length: 291, dtype: int64

In [39]:
new_data['Lifeboat'].value_counts()
#Giving insight into how many people boarded which lifeboard, indicating how many people were able to get a lifeboat and which one

Lifeboat
13       42
C        41
15       38
14       34
4        31
5        29
10       29
3        26
9        26
11       26
8        24
16       23
7        22
6        21
12       18
D        18
2        14
?        12
A        11
B         9
1         5
14?       1
A[64]     1
15?       1
Name: count, dtype: int64

In [40]:
new_data['Body'].value_counts()

Body
175MB    1
96MB     1
189MB    1
209MB    1
58MB     1
        ..
314      1
72MB     1
295MB    1
236MB    1
32MB     1
Name: count, Length: 130, dtype: int64